Revit 2026 API

# ZoneElementDomainData Properties

---

The ZoneElementDomainData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

ZoneElementDomainData Class

Autodesk.Revit.DB.Mechanical Namespace